<!DOCTYPE html>
<html lang="en">
<head>
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type">
<meta content="IE=edge,chrome=1" http-equiv="X-UA-Compatible">
<meta content="Asciidoctor 1.5.0" name="generator">
<title>Neo4j Intro Training</title>
<script src="../../../../asciidoc/deck.js/jquery.min.js"></script>
<script src="../../../../asciidoc/deck.js/core/deck.core.js"></script>
<link href="http://cdnjs.cloudflare.com/ajax/libs/font-awesome/3.2.1/css/font-awesome.min.css" rel="stylesheet">
<link href="../../../../asciidoc/deck.js/extensions/codemirror/deck.codemirror.css" rel="stylesheet">
<link href="../../../../asciidoc/deck.js/extensions/codemirror/themes/iq.css" rel="stylesheet">
<script src="../../../../asciidoc/deck.js/extensions/codemirror/codemirror.js"></script>
<script src="../../../../asciidoc/deck.js/extensions/codemirror/deck.codemirror.js"></script>
<script src="../../../../asciidoc/deck.js/extensions/codemirror/mode/javascript/javascript.js"></script>
<script src="../../../../asciidoc/deck.js/extensions/codemirror/mode/css/css.js"></script>
<script src="../../../../asciidoc/deck.js/extensions/codemirror/mode/htmlmixed/htmlmixed.js"></script>
<script src="../../../../asciidoc/deck.js/extensions/codemirror/mode/plsql/plsql.js"></script>
<script src="../../../../asciidoc/deck.js/extensions/cypher/deck.cypher.js"></script>
<link href="../../../../asciidoc/deck.js/extensions/cypher/deck.cypher.css" rel="stylesheet">
<link href="../../../../asciidoc/deck.js/core/deck.core.css" rel="stylesheet">
<link href="../../../../asciidoc/deck.js/extensions/hash/deck.hash.css" media="screen" rel="stylesheet">
<link href="../../../../asciidoc/deck.js/extensions/scale/deck.scale.css" media="screen" rel="stylesheet">
<link href="../../../../asciidoc/deck.js/extensions/goto/deck.goto.css" media="screen" rel="stylesheet">
<link href="../../../../asciidoc/deck.js/extensions/menu/deck.menu.css" media="screen" rel="stylesheet">
<link href="../../../../asciidoc/deck.js/extensions/navigation/deck.navigation.css" media="screen" rel="stylesheet">
<link href="../../../../asciidoc/deck.js/extensions/status/deck.status.css" media="screen" rel="stylesheet">
<link href="../../../../asciidoc/deck.js/extensions/toc/deck.toc.css" media="screen" rel="stylesheet">
<link href="../../../../asciidoc/deck.js/themes/style/neotech-iq.css" media="screen" rel="stylesheet">
<link href="../../../../asciidoc/deck.js/core/print.css" media="print" rel="stylesheet">
<script src="../../../../asciidoc/deck.js/modernizr.custom.js"></script>
</head>
<body class="deck-container article">
<section class="slide" id="title-slide">
<h1>Neo4j Intro Training</h1>
</section>
<section class="slide" id="_welcome">
<h2>Welcome</h2>

</section>
<section class="slide" id="_who_are_you">
<h2>Who are you?</h2>
<div class="ulist">
<ul>
<li>Where are you from?</li>
<li>What are you doing all day?</li>
<li>What are your expectations?</li>
</ul>
</div>
</section>
<section class="slide" id="_today_you_can_answer">
<h2>Today you can answer</h2>
<div class="ulist">
<ul>
<li class="slide">What is Neo4j?</li>
<li class="slide">Why would I use it?</li>
<li class="slide">How do I model data?</li>
<li class="slide">How do I enter data?</li>
<li class="slide">How do I query data?</li>
<li class="slide">and provide confidence start building a graph enabled application</li>
</ul>
</div>
</section>
<section class="slide" id="_schedule">
<h2>Schedule</h2>
<div class="ulist">
<ul>
<li>Graphs and Modeling</li>
<li><em>Coffee break</em></li>
<li>Neo4j and Cypher</li>
<li><em>Lunch</em></li>
<li>Advanced queries using Cypher</li>
<li><em>Coffee break</em></li>
<li>Next steps and Q&amp;A</li>
</ul>
</div>
</section>
<section class="slide" id="_graphs_are_everywhere">
<h2>Graphs are everywhere</h2>
<div class="imageblock">
<div class="content">
<img alt="use cases" src="img/usecases/use_cases.jpg">
</div>
</div>
</section>
<section class="slide" id="_social_network">
<h2>Social Network</h2>
<div class="imageblock">
<div class="content">
<img alt="social network" src="img/usecases/social_network.jpg">
</div>
</div>
</section>
<section class="slide" id="_routing_logistics">
<h2>Routing &amp; Logistics</h2>
<div class="imageblock">
<div class="content">
<img alt="logistics" src="img/usecases/logistics.jpg">
</div>
</div>
</section>
<section class="slide" id="_impact_analytics">
<h2>Impact Analytics</h2>
<div class="imageblock">
<div class="content">
<img alt="network impact analysis" src="img/usecases/network_impact_analysis.jpg">
</div>
</div>
</section>
<section class="slide" id="_recommendations">
<h2>Recommendations</h2>
<div class="imageblock">
<div class="content">
<img alt="recommendations" src="img/usecases/recommendations.jpg">
</div>
</div>
</section>
<section class="slide" id="_access_control">
<h2>Access Control</h2>
<div class="imageblock">
<div class="content">
<img alt="access control" src="img/usecases/access_control.jpg">
</div>
</div>
</section>
<section class="slide" id="_fraud_analysis">
<h2>Fraud Analysis</h2>
<div class="imageblock">
<div class="content">
<img alt="fraud analysis" src="img/usecases/fraud_analysis.jpg">
</div>
</div>
</section>
<section class="slide" id="_and_in_my_domain">
<h2>And in my domain?</h2>
<div class="ulist">
<ul>
<li>Nearly any information can be represented as graph</li>
<li>What about information systems in your company?</li>
<li>Which domains make perfectly sense to represent as graph?</li>
<li>And which do not?</li>
</ul>
</div>
</section>
<section class="slide" id="_our_sample_domain_for_today">
<h2>Our sample domain for today</h2>
<div class="paragraph"><p>Today we will deal with entities present in typical enterprise scenarios:</p></div>
<div class="ulist">
<ul>
<li>People and Organizations</li>
<li>Organizational structures, projects and teams</li>
</ul>
</div>
</section>
<section class="slide" id="_our_approach">
<h2>Our Approach</h2>
<div class="ulist">
<ul>
<li>Entities and Use-Cases</li>
<li>Identify some interesting aspects of the domain model</li>
<li>Show and quickly discuss domain model choices</li>
</ul>
</div>
<section class="slide" id="_relational">
<h3>Relational</h3>
<div class="ulist">
<ul>
<li>Ask: Aspects of relational physical model</li>
<li>Show &amp; explain relational model</li>
<li>Discuss what works well in a relational model, and what not so much</li>
</ul>
</div>
</section>
<section class="slide" id="_graph">
<h3>Graph</h3>
<div class="ulist">
<ul>
<li>Ask: Aspects of graph model</li>
<li>Introduce Property Graph Model</li>
<li>Show &amp; explain graph model</li>
<li>Discuss what works well in a graph model, and what not so much</li>
</ul>
</div>
</section>
</section>
<section class="slide" id="_description_of_sample_domain">
<h2>Description of sample domain</h2>
<div class="ulist condensed-75">
<ul class="condensed-75">
<li class="slide">'Entities' can be natural persons (humans) or legal entities (organizations)</li>
<li class="slide">Legal entities are structured in hierarchical departments</li>
<li class="slide">People are employees of a department and every department has a lead</li>
<li class="slide">Projects belong to departments and have team member</li>
<li class="slide">Entities have addresses and locations</li>
<li class="slide">Persons have a day of birth and birthplaces, organizations have a tax ID</li>
<li class="slide">Addresses belong to cities, cities to countries and countries to continents</li>
<li class="slide">Organizations have offices in different cities where projects take place</li>
</ul>
</div>
</section>
<section class="slide" id="_use_cases">
<h2>Use-Cases</h2>
<div class="ulist">
<ul>
<li>Navigate organisational hierarchy</li>
<li>Find offices of a company in certain locations</li>
<li>Compute worktime of employees in department for all their projects</li>
<li>Co-Workers, project members, department leads, superiors</li>
<li>Weekly worktime across projects</li>
<li>Similar project roles</li>
</ul>
</div>
</section>
<section class="slide" id="_steps_develop_domain_model">
<h2>Steps: Develop domain model</h2>
<div class="ulist">
<ul>
<li>Identify entity types (maybe abstract and concrete ones)</li>
<li>Define some important attributes</li>
<li>Define the relations between them</li>
</ul>
</div>
</section>
<section class="slide canvas-image" id="_flip_chart_excercise" style="background-image: url(./img/flipchart.jpg)">
<div class="paragraph canvas-caption"><p class="center">Draw domain model</p></div>
<div class="paragraph img-ref"><p>derivative of <a href="https://www.flickr.com/photos/adrianhoward/4837810685/in/set-72157624602972332">Flip Chart</a> by <a href="https://www.flickr.com/photos/adrianhoward/">Adrian Howard</a> / <a href="http://creativecommons.org/licenses/by/2.0/">CC BY</a></p></div>
</section>
<section class="slide" id="_possible_solution">
<h2>Possible solution</h2>
<div class="ulist">
<ul>
<li>The model we had in mind:</li>
</ul>
</div>
<div class="imageblock">
<div class="content">
<img alt="persons and units" src="../../img/persons-and-units.png">
</div>
</div>
</section>
<section class="slide" id="_relevant_extract_for_next_steps">
<h2>Relevant extract for next steps</h2>
<div class="imageblock">
<div class="content">
<img alt="simplified" src="./diagrams/simplified.png">
</div>
</div>
<div class="ulist">
<ul>
<li>(We may need this later when we start with cypher)</li>
</ul>
</div>
</section>
<section class="slide canvas-image" id="_flip_chart_excercise_2" style="background-image: url(./img/flipchart.jpg)">
<div class="paragraph canvas-caption"><p class="center">Transfer to Relational Logical Model</p></div>
<div class="paragraph img-ref"><p>derivative of
<a href="https://www.flickr.com/photos/adrianhoward/4837810685/in/set-72157624602972332">Flip Chart</a> by <a href="https://www.flickr.com/photos/adrianhoward/">Adrian Howard</a> /
href="http://creativecommons.org/licenses/by/2.0/[CC BY]</p></div>
</section>
<section class="slide" id="_aspects_of_the_relational_model">
<h2>Aspects of the Relational Model</h2>
<div class="ulist">
<ul>
<li>Tables, rows and columns</li>
<li>Primary Keys</li>
<li>Relations via Foreign keys</li>
<li>JOIN n:m tables for many-to-many relatations</li>
<li>Artificial tables to add meta info to relations</li>
</ul>
</div>
</section>
<section class="slide" id="_show_relational_model">
<h2>Show Relational Model</h2>
<div class="imageblock">
<div class="content">
<img alt="RDB Relation Sample" src="../../imgimg/RDB_Relation_Sample.png">
</div>
</div>
</section>
<section class="slide canvas-image" id="_discuss_what_works_what_less_so" style="background-image: url(./img/flipchart.jpg)">
<section class="slide" id="_works_well">
<h3>Works Well</h3>
<div class="ulist">
<ul>
<li>aggregate normalized data</li>
</ul>
</div>
</section>
</section>
<section class="slide" id="_what_less_so">
<h2>What less so?</h2>
<div class="ulist">
<ul>
<li>Manys-Join queries</li>
<li>many-to-many relationships</li>
<li>inheritance</li>
<li>sparse table</li>
<li>optional relationships</li>
<li>hierarchies</li>
</ul>
</div>
<div class="paragraph canvas-caption"><p class="center">Excercise 3: Aspects of Graph Model</p></div>
<div class="paragraph img-ref"><p>derivative of <a href="https://www.flickr.com/photos/adrianhoward/4837810685/in/set-72157624602972332">"Flip Chart"</a>
by <a href="https://www.flickr.com/photos/adrianhoward/">Adrian Howard</a> / <a href="http://creativecommons.org/licenses/by/2.0/">CC BY</a></p></div>
</section>
<section class="slide" id="_aspects_of_graph_model">
<h2>Aspects of Graph Model</h2>
<div class="ulist">
<ul>
<li>Nodes and Connections</li>
<li>No Schema</li>
</ul>
</div>
</section>
<section class="slide" id="_introduction_property_graph_model">
<h2>Introduction: Property Graph Model</h2>
<div class="ulist">
<ul>
<li>Nodes for entities and attributes to match over</li>
<li>Labels assign roles to nodes</li>
<li>Nodes have arbitrary properties</li>
<li>Relationships connect nodes</li>
<li>Relationships are named and directed</li>
<li>Relationships also contain (mostly) qualifying properties</li>
</ul>
</div>
</section>
<section class="slide" id="_show_property_graph_model">
<h2>Show Property Graph Model</h2>

</section>
<section class="slide" id="__todo_and_as_a_graph">
<h2>(TODO) and as a graph?</h2>
<div class="ulist">
<ul>
<li>same data as graph</li>
<li>object model</li>
<li>two persons</li>
<li>their attributes</li>
<li>relationship person to organizational units</li>
<li>properties of relationship</li>
<li>nodes of different types &#8594; label</li>
</ul>
</div>
</section>
<section class="slide canvas-image" id="_discuss_what_works_what_less_so_2" style="background-image: url(./img/flipchart.jpg)">
<section class="slide" id="_works_well_2">
<h3>Works Well</h3>
<div class="ulist">
<ul>
<li>schema free</li>
<li>inheritance with labels</li>
<li>hierarchies</li>
<li>optional attributes and relationships</li>
</ul>
</div>
</section>
</section>
<section class="slide" id="_what_less_so_2">
<h2>What less so?</h2>
<div class="ulist">
<ul>
<li>global queries</li>
<li>binary data</li>
<li>wide and deep traversals</li>
</ul>
</div>
</section>
<section class="slide" id="_discussion_compare_relational_and_graph_model">
<h2>Discussion: Compare relational and graph model</h2>
<div class="ulist">
<ul>
<li>What do they have in common?</li>
<li>What are differences?</li>
<li>Is any of them easier to create?</li>
<li>Which one feels more natural to you?</li>
<li>What do you think about "schema free"?</li>
</ul>
</div>
</section>
<section class="slide" id="_so_what_about_data">
<h2>So what about data?</h2>

</section>
<section class="slide" id="_alice_bob">
<h2>Alice &amp; Bob</h2>
<figure class="graph-diagram">
<ul class="graph-diagram-markup" data-internal-scale="1.58" data-external-scale="1">
  <li class="node" data-node-id="0" data-x="-115.53164556962025" data-y="-540.7594936708862">
    <span class="caption">Bob</span>
  </li>
  <li class="node" data-node-id="1" data-x="-358.9403254972869" data-y="-330.334538878843">
    <span class="caption">Book</span><dl class="properties"><dt>title</dt><dd>"Graph Databases"</dd></dl></li>
  <li class="node" data-node-id="2" data-x="-565.6753022399126" data-y="-595.5646381619613">
    <span class="caption">Alice</span>
  </li>
  <li class="relationship" data-from="0" data-to="1">
    <span class="type">Has Read</span>
  </li>
  <li class="relationship" data-from="0" data-to="2">
    <span class="type">Friend Of</span>
  </li>
  <li class="relationship" data-from="2" data-to="1">
    <span class="type">Has Read</span>
  </li>
  <li class="relationship" data-from="2" data-to="0">
    <span class="type">Friend Of</span>
  </li>
</ul>
</figure>
</section>
<section class="slide" id="_add_detail">
<h2>Add Detail</h2>
<figure class="graph-diagram">
<ul class="graph-diagram-markup" data-internal-scale="1.58" data-external-scale="1">
  <li class="node" data-node-id="0" data-x="-115.53164556962025" data-y="-540.7594936708862">
    <span class="caption">Entity</span><dl class="properties"><dt>name</dt><dd>Bob</dd><dt>age</dt><dd>38</dd></dl></li>
  <li class="node" data-node-id="1" data-x="-358.9403254972869" data-y="-330.334538878843">
    <span class="caption">Book</span><dl class="properties"><dt>title</dt><dd>"Graph Databases"</dd><dt>authors</dt><dd>"Ian Robinson, ..."</dd></dl></li>
  <li class="node" data-node-id="2" data-x="-565.6753022399126" data-y="-595.5646381619613">
    <span class="caption">Entity</span><dl class="properties"><dt>name</dt><dd>Alice</dd><dt>age</dt><dd>34</dd></dl></li>
  <li class="relationship" data-from="0" data-to="1">
    <span class="type">Has Read</span><dl class="properties"><dt>date</dt><dd>Jun-03</dd><dt>rating</dt><dd>4</dd></dl></li>
  <li class="relationship" data-from="0" data-to="2">
    <span class="type">Friend Of</span>
  </li>
  <li class="relationship" data-from="2" data-to="1">
    <span class="type">Has Read</span><dl class="properties"><dt>date</dt><dd>Dec-05</dd><dt>rating</dt><dd>5</dd></dl></li>
  <li class="relationship" data-from="2" data-to="0">
    <span class="type">Friend Of</span>
  </li>
</ul>
</figure>
</section>
<section class="slide" id="_segue_graphs_in_a_relational_world">
<h2>Segue: Graphs in a Relational World</h2>

</section>
<section class="slide" id="_tables">
<h2>Tables</h2>
<div class="imageblock">
<div class="content">
<img alt="rel graph0" src="../../img/rel_graph0.jpg">
</div>
</div>
</section>
<section class="slide" id="_one_table_for_customers">
<h2>One table for Customers</h2>
<div class="imageblock">
<div class="content">
<img alt="rel graph1" src="../../img/rel_graph1.jpg">
</div>
</div>
</section>
<section class="slide" id="_another_one_for_accounts">
<h2>Another one for Accounts</h2>
<div class="imageblock">
<div class="content">
<img alt="rel graph2" src="../../img/rel_graph2.jpg">
</div>
</div>
</section>
<section class="slide" id="_a_link_table_in_between">
<h2>A link table in between</h2>
<div class="imageblock">
<div class="content">
<img alt="rel graph3" src="../../img/rel_graph3.jpg">
</div>
</div>
<div class="paragraph"><p>for many-to-many relationships</p></div>
</section>
<section class="slide" id="_joining_them">
<h2>JOINing them</h2>
<div class="imageblock">
<div class="content">
<img alt="rel graph4" src="../../img/rel_graph4.jpg">
</div>
</div>
</section>
<section class="slide" id="_this_is_the_data">
<h2>This is the data</h2>
<div class="imageblock">
<div class="content">
<img alt="rel graph5" src="../../img/rel_graph5.jpg">
</div>
</div>
</section>
<section class="slide" id="_explicit_as_a_graph">
<h2>Explicit as a graph</h2>
<div class="imageblock">
<div class="content">
<img alt="rel graph6" src="../../img/rel_graph6.jpg">
</div>
</div>
</section>
<section class="slide" id="_nodes">
<h2>Nodes, &#8230;&#8203;</h2>
<div class="imageblock">
<div class="content">
<img alt="rel graph7" src="../../img/rel_graph7.jpg">
</div>
</div>
</section>
<section class="slide" id="_nodes_relationships_and">
<h2>Nodes, Relationships and &#8230;&#8203;</h2>
<div class="imageblock">
<div class="content">
<img alt="rel graph8" src="../../img/rel_graph8.jpg">
</div>
</div>
</section>
<section class="slide" id="_nodes_relationships_and_labels">
<h2>Nodes, Relationships and Labels.</h2>
<div class="imageblock">
<div class="content">
<img alt="rel graph9" src="../../img/rel_graph9.jpg">
</div>
</div>
</section>
<section class="slide" id="_modeling_with_graphs">
<h2>Modeling with graphs</h2>

</section>
<section class="slide" id="_start_with_a_whiteboard">
<h2>Start with a whiteboard</h2>

</section>
<section class="slide" id="_1">
<h2>1</h2>
<div class="imageblock">
<div class="content">
<img alt="model1" src="../../img/model1.png">
</div>
</div>
</section>
<section class="slide" id="_2">
<h2>2</h2>
<div class="imageblock">
<div class="content">
<img alt="model2" src="../../img/model2.png">
</div>
</div>
</section>
<section class="slide" id="_3">
<h2>3</h2>
<div class="imageblock">
<div class="content">
<img alt="model3" src="../../img/model3.png">
</div>
</div>
</section>
<section class="slide" id="_4">
<h2>4</h2>
<div class="imageblock">
<div class="content">
<img alt="model4" src="../../img/model4.png">
</div>
</div>
</section>
<section class="slide" id="_5">
<h2>5</h2>
<div class="imageblock">
<div class="content">
<img alt="model5" src="../../img/model5.png">
</div>
</div>
</section>
<section class="slide" id="_model_incrementally">
<h2>Model incrementally</h2>

</section>
<section class="slide" id="_6">
<h2>6</h2>
<div class="imageblock">
<div class="content">
<img alt="model6" src="../../img/model6.png">
</div>
</div>
</section>
<section class="slide" id="_7">
<h2>7</h2>
<div class="imageblock">
<div class="content">
<img alt="model7" src="../../img/model7.png">
</div>
</div>
</section>
<section class="slide" id="__brief_tour_of_neo4j">
<h2>(Brief tour of Neo4j)</h2>

</section>
<section class="slide" id="_neo4j_browser_finding_help">
<h2>Neo4j Browser - finding help</h2>
<div class="imageblock">
<div class="content">
<img alt="browser1" src="../../img/browser1.png">
</div>
</div>
</section>
<section class="slide" id="_neo4j_browser_execute_cypher_visualize">
<h2>Neo4j Browser - execute Cypher, visualize</h2>
<div class="imageblock">
<div class="content">
<img alt="browser2" src="../../img/browser2.png">
</div>
</div>
</section>
<section class="slide" id="_neo4j_browser_importing_sample_data">
<h2>Neo4j Browser - importing sample data</h2>
<div class="imageblock">
<div class="content">
<img alt="browser3" src="../../img/browser3.png">
</div>
</div>
</section>
<section class="slide" id="_neo4j_data_browser_display_more_data">
<h2>Neo4j Data browser - display more data</h2>
<div class="imageblock">
<div class="content">
<img alt="browser4" src="../../img/browser4.png">
</div>
</div>
</section>
<section class="slide canvas-image" id="_coffee" style="background-image: url(./img/coffee1-sw.jpg)">
<div class="paragraph canvas-caption"><p class="center">Coffee?</p></div>
<div class="img-ref">
derivative of <a href="https://www.flickr.com/photos/greencolander/432856237">"Espresso"</a> by <a href="https://www.flickr.com/photos/greencolander/">Michelle Tribe</a> / <a href="http://creativecommons.org/licenses/by/2.0/">CC BY</a>
<div>
</section>
<section class="slide canvas-image" id="_intro_to_cypher" style="background-image: url(./img/enigma-sw.jpg)">
<div class="paragraph canvas-caption"><p class="center">Let&#8217;s talk about Cypher</p></div>
<div class="img-ref">
derivative of <a href="http://www.flickr.com/photos/sixteenmilesofstring/8256206923/in/set-72157632200936657">"ENIGMA machine"</a> by <a href="https://www.flickr.com/photos/epitti/">Erik Pitti</a> / <a href="http://creativecommons.org/licenses/by/2.0/">CC BY</a>
<div>
</section>
<section class="slide" id="_what_is_cypher">
<h2>What is Cypher?</h2>
<div class="ulist">
<ul>
<li class="slide">Neo4j&#8217;s graph query language</li>
<li class="slide">Declarative Pattern-Matching language</li>
<li class="slide">SQL-like syntax</li>
<li class="slide">Designed for graphs</li>
</ul>
</div>
</section>
<section class="slide" id="_enterprise_model_revisited">
<h2>Enterprise model revisited</h2>
<div class="imageblock">
<div class="content">
<img alt="simplified" src="./diagrams/simplified.png">
</div>
</div>
</section>
<section class="slide" id="_find_employees_of_the_it_department">
<h2>Find employees of the IT-Department</h2>
<div class="paragraph slide"><p>with SQL:</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="plsql">SELECT * FROM Person
LEFT JOIN Person_Department
  ON Person.Id = Person_Department.PersonId
LEFT JOIN Department
  ON Department.Id = Person_Department.DepartmentId
WHERE Department.name = "IT-Department"</textarea>
</div>
</div>
<div class="paragraph slide"><p>with Cypher&#8230;&#8203;</p></div>
</section>
<section class="slide canvas-image" id="_it_s_all_about_patterns" style="background-image: url(./img/pattern.jpg)">
<div class="paragraph canvas-caption"><p class="center">It&#8217;s all about patterns</p></div>
<div class="paragraph img-ref"><p><a href="https://www.flickr.com/photos/just-textures/14225505282">"16_22_inv"</a> by
<a href="https://www.flickr.com/photos/just-textures/">Ed Jones</a> /
<a href="http://creativecommons.org/licenses/by/2.0/">CC BY</a></p></div>
</section>
<section class="slide" id="_from_tables_to_patterns">
<h2>From Tables to Patterns</h2>
<div class="paragraph slide"><p>What graph pattern are we looking for?</p></div>
</section>
<section class="slide" id="_from_tables_to_patterns_2">
<h2>From Tables to Patterns</h2>
<div class="paragraph"><p>What graph pattern are we looking for?</p></div>
<figure class="graph-diagram">
  <ul class="graph-diagram-markup" data-internal-scale="1.47" data-external-scale="0.5">
    <li class="node" data-node-id="1" data-x="-676" data-y="-19">
      <span class="caption">p:Person</span>
    </li>
    <li class="node" data-node-id="2" data-x="221.7539520263672" data-y="-19">
      <span class="caption">d:Dept</span>
    </li>
    <li class="relationship" data-from="2" data-to="1">
      <span class="type">:EMPLOYEE</span>
    </li>
  </ul>
</figure>
<div class="paragraph slide"><p>The pattern in Cypher:</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">(p:Person)&lt;-[:EMPLOYEE]-(d:Dept)</textarea>
</div>
</div>
</section>
<section class="slide" id="_from_sql_to_cypher">
<h2>From SQL to Cypher</h2>
<div class="paragraph slide"><p><code>MATCH</code> allows you to find a pattern in the graph</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)&lt;-[:EMPLOYEE]-(d:Dept)
RETURN p.name, d.name</textarea>
</div>
</div>
<div class="paragraph slide"><p><code>WHERE</code> allows you to filter the results</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)&lt;-[:EMPLOYEE]-(d:Dept)
WHERE d.name = "IT-Department"
RETURN p.name, d.name</textarea>
</div>
</div>
</section>
<section class="slide" id="_sql_vs_cypher">
<h2>SQL vs. Cypher</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="plsql">SELECT * FROM Person
LEFT JOIN Person_Department
  ON Person.Id = Person_Department.PersonId
LEFT JOIN Department
  ON Department.Id = Person_Department.DepartmentId
WHERE Department.name = "IT-Department</textarea>
</div>
</div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)&lt;-[:EMPLOYEE]-(d:Dept)
WHERE d.name = "IT-Department"
RETURN p.name, d.name</textarea>
</div>
</div>
</section>
<section class="slide" id="_patterns_in_detail">
<h2>Patterns in detail</h2>
<div class="paragraph"><p>with directed relationship</p></div>
<figure class="graph-diagram">
  <ul class="graph-diagram-markup" data-internal-scale="10" data-external-scale="1">
    <li class="node" data-node-id="0" data-x="-50" data-y="-40">
      <span class="caption">a</span>
    </li>
    <li class="node" data-node-id="1" data-x="-20" data-y="-40">
      <span class="caption">b</span>
    </li>
    <li class="relationship" data-from="0" data-to="1"></li>
  </ul>
</figure>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">(a)--&gt;(b)</textarea>
</div>
</div>
</section>
<section class="slide" id="_patterns_in_detail_2">
<h2>Patterns in detail</h2>
<div class="paragraph"><p>with undirected relationship</p></div>
<figure class="graph-diagram">
  <ul class="graph-diagram-markup" data-internal-scale="10" data-external-scale="1">
    <li class="node" data-node-id="0" data-x="-50" data-y="-40">
      <span class="caption">a</span>
    </li>
    <li class="node" data-node-id="1" data-x="-20" data-y="-40">
      <span class="caption">b</span>
    </li>
    <li class="relationship" data-from="0" data-to="1" data-undirected="true"></li>
  </ul>
</figure>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">(a)--(b)</textarea>
</div>
</div>
</section>
<section class="slide" id="_patterns_in_detail_3">
<h2>Patterns in detail</h2>
<figure class="graph-diagram">
  <ul class="graph-diagram-markup" data-internal-scale="1.47" data-external-scale="1">
    <li class="node" data-node-id="1" data-x="-676" data-y="-19">
      <span class="caption">a</span>
    </li>
    <li class="node" data-node-id="2" data-x="-436.7494493341767" data-y="-19"></li>
    <li class="node" data-node-id="3" data-x="-203.94842072571268" data-y="-19">
      <span class="caption">b</span>
    </li>
    <li class="relationship" data-from="1" data-to="2"></li>
    <li class="relationship" data-from="2" data-to="3"></li>
  </ul>
</figure>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">(a)--&gt;()--&gt;(b)</textarea>
</div>
</div>
</section>
<section class="slide" id="_label">
<h2>Label</h2>
<div class="paragraph"><p>Find all humans</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)
RETURN p.name;</textarea>
</div>
</div>
</section>
<section class="slide" id="_relationship_types">
<h2>Relationship types</h2>
<div class="paragraph"><p>Find employees of a department</p></div>
<figure class="graph-diagram">
  <ul class="graph-diagram-markup" data-internal-scale="1.47" data-external-scale="1">
    <li class="node" data-node-id="1" data-x="-676" data-y="-19">
      <span class="caption">h</span>
    </li>
    <li class="node" data-node-id="2" data-x="-351.03516361989097" data-y="-19">
      <span class="caption">d</span>
    </li>
    <li class="relationship" data-from="2" data-to="1">
      <span class="type">:EMPLOYEE</span>
    </li>
  </ul>
</figure>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p)&lt;-[:EMPLOYEE]-(d)
RETURN p.name, d.name;</textarea>
</div>
</div>
</section>
<section class="slide" id="_relationship_types_and_labels">
<h2>Relationship types and labels</h2>
<div class="paragraph"><p>Find employees of a department</p></div>
<figure class="graph-diagram">
  <ul class="graph-diagram-markup" data-internal-scale="1.47" data-external-scale="0.5">
    <li class="node" data-node-id="1" data-x="-676" data-y="-19">
      <span class="caption">p:Person</span>
    </li>
    <li class="node" data-node-id="2" data-x="221.7539520263672" data-y="-19">
      <span class="caption">d:Dept</span>
    </li>
    <li class="relationship" data-from="2" data-to="1">
      <span class="type">:EMPLOYEE</span>
    </li>
  </ul>
</figure>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)&lt;-[:EMPLOYEE]-(d:Dept)
RETURN p.name, d.name;</textarea>
</div>
</div>
</section>
<section class="slide canvas-image" id="_start_coding" style="background-image: url(./img/coding-sw.jpg)">
<div class="paragraph canvas-caption"><p class="center">Start coding!</p></div>
<div class="paragraph img-ref"><p>derivative of href="https://www.flickr.com/photos/adikos/4440682278["Female Typing"] by
<a href="https://www.flickr.com/photos/adikos/">Adikos</a> /
<a href="http://creativecommons.org/licenses/by/2.0/">CC BY</a></p></div>
</section>
<section class="slide" id="_first_excercise">
<h2>First Excercise</h2>
<div class="ulist">
<ul>
<li>Find the names of all organizations.</li>
<li>Who works in the same departments as Daniel?</li>
<li>Which organizations have offices in Paris?</li>
<li>In which countries has "GraphIT" offices?</li>
</ul>
</div>
<div class="paragraph"><p><em>Labels: Person, Org, Dept, Entity, Office, City</em></p></div>
<div class="paragraph"><p><em>Relationship Types: EMPLOYEE, SITE, LOCATION, IS_IN</em></p></div>
<div class="paragraph"><p><em>All nodes have a <code>name</code> property</em></p></div>
</section>
<section class="slide" id="_find_all_organizations">
<h2>Find all organizations</h2>
<div class="paragraph slide"><p>Pattern</p></div>
<div class="paragraph"><p>Pattern</p></div>
<figure class="graph-diagram">
  <ul class="graph-diagram-markup" data-internal-scale="1.47" data-external-scale="0.6">
    <li class="node" data-node-id="1" data-x="-676" data-y="-19">
      <span class="caption">o:Org</span>
    </li>
  </ul>
</figure>
<div class="paragraph slide"><p>Cypher</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (o:Org)
RETURN o.name;</textarea>
</div>
</div>
</section>
<section class="slide" id="_colleagues_of_daniel">
<h2>Colleagues of Daniel</h2>
<div class="paragraph slide"><p>Pattern</p></div>
</section>
<section class="slide" id="_colleagues_of_daniel_2">
<h2>Colleagues of Daniel</h2>
<div class="paragraph"><p>Pattern</p></div>
<figure class="graph-diagram">
  <ul class="graph-diagram-markup" data-internal-scale="4.26" data-external-scale="0.6">
    <li class="node" data-node-id="4" data-x="-1697.3037903549252" data-y="-31.244897959183675">
      <span class="caption">p:Person</span>
    </li>
    <li class="node" data-node-id="5" data-x="-1498.2804922128632" data-y="-31.244897959183675">
      <span class="caption">d:Dept</span>
    </li>
    <li class="node" data-node-id="6" data-x="-1297.1275555499185" data-y="-31.244897959183675">
      <span class="caption">b:Person</span>
    </li>
    <li class="relationship" data-from="5" data-to="4">
      <span class="type">:EMPLOYEE</span>
    </li>
    <li class="relationship" data-from="5" data-to="6">
      <span class="type">:EMPLOYEE</span>
    </li>
  </ul>
</figure>
<div class="paragraph slide"><p>Cypher</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)&lt;-[:EMPLOYEE]-(d:Dept),
      (d)-[:EMPLOYEE]-&gt;(b:Person)
WHERE p.name = "Daniel"
RETURN b.name;</textarea>
</div>
</div>
</section>
<section class="slide" id="_organizations_with_offices_in_paris">
<h2>Organizations with offices in Paris</h2>
<div class="paragraph slide"><p>Pattern</p></div>
</section>
<section class="slide" id="_companies_with_offices_in_paris">
<h2>Companies with offices in Paris</h2>
<div class="paragraph"><p>Pattern</p></div>
<figure class="graph-diagram">
  <ul class="graph-diagram-markup" data-internal-scale="1.54" data-external-scale="0.6">
    <li class="node" data-node-id="1" data-x="-926.9929027097343" data-y="-31.244897959183675">
      <span class="caption">c:City</span>
    </li>
    <li class="node" data-node-id="3" data-x="-1271.278139283057" data-y="-31.244897959183675">
      <span class="caption">:Office</span>
    </li>
    <li class="node" data-node-id="4" data-x="-1697.3037903549252" data-y="-31.244897959183675">
      <span class="caption">o:Org</span>
    </li>
    <li class="relationship" data-from="3" data-to="1">
      <span class="type">:LOCATION</span>
    </li>
    <li class="relationship" data-from="4" data-to="3">
      <span class="type">:SITE</span>
    </li>
  </ul>
</figure>
<div class="paragraph slide"><p>Cypher</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (o:Org)-[:SITE]-&gt;(:Office)-[:LOCATION]-&gt;(c:City)
WHERE c.name = "Paris"
RETURN o.name;</textarea>
</div>
</div>
</section>
<section class="slide" id="_countries_with_graphit_offices">
<h2>Countries with "GraphIT" offices</h2>
<div class="paragraph slide"><p>Pattern</p></div>
</section>
<section class="slide" id="_countries_with_graphit_offices_2">
<h2>Countries with "GraphIT" offices</h2>
<div class="paragraph"><p>Pattern</p></div>
<figure class="graph-diagram">
  <ul class="graph-diagram-markup" data-internal-scale="1.54" data-external-scale="0.6">
    <li class="node" data-node-id="1" data-x="-1035.4194005283218" data-y="-31.244897959183675">
      <span class="caption">:City</span>
    </li>
    <li class="node" data-node-id="3" data-x="-1416.3285051769287" data-y="-31.244897959183675">
      <span class="caption">:Office</span>
    </li>
    <li class="node" data-node-id="4" data-x="-1697.3037903549252" data-y="-31.244897959183675">
      <span class="caption">o:Organization</span>
    </li>
    <li class="node" data-node-id="5" data-x="-734.977202670841" data-y="-31.244897959183675">
      <span class="caption">c:Country</span>
    </li>
    <li class="relationship" data-from="3" data-to="1">
      <span class="type">:LOCATION</span>
    </li>
    <li class="relationship" data-from="4" data-to="3">
      <span class="type">:SITE</span>
    </li>
    <li class="relationship" data-from="1" data-to="5">
      <span class="type">:IS_IN</span>
    </li>
  </ul>
</figure>
<div class="paragraph slide"><p>Cypher</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (o:Org {name:"GraphIT"})-[:SITE]-&gt;(office:Office),
      (office)-[:LOCATION]-&gt;(:City)-[:IS_IN]-&gt;(c:Country)
RETURN c.name;</textarea>
</div>
</div>
</section>
<section class="slide" id="_remove_result_duplicates">
<h2>Remove result duplicates</h2>
<div class="paragraph slide"><p><code>RETURN DISTINCT</code> returns only unique rows</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (o:Org)--&gt;(:Office)--&gt;(:City)--&gt;(c:Country)
WHERE o.name = "GraphIT"
RETURN DISTINCT c.name;</textarea>
</div>
</div>
</section>
<section class="slide" id="_optional_relationships">
<h2>Optional relationships</h2>
<div class="paragraph"><p>Pattern</p></div>
<figure class="graph-diagram">
  <ul class="graph-diagram-markup" data-internal-scale="1.54" data-external-scale="1">
    <li class="node" data-node-id="4" data-x="-1697.3037903549252" data-y="-31.244897959183675">
      <span class="caption">a</span>
    </li>
  </ul>
</figure>
<div class="paragraph"><p>or</p></div>
<figure class="graph-diagram">
  <ul class="graph-diagram-markup" data-internal-scale="4.26" data-external-scale="1">
    <li class="node" data-node-id="4" data-x="-1697.3037903549252" data-y="-31.244897959183675">
      <span class="caption">a</span>
    </li>
    <li class="node" data-node-id="5" data-x="-1612.13025747108" data-y="-31.244897959183675">
      <span class="caption">b</span>
    </li>
    <li class="relationship" data-from="4" data-to="5">
      <span class="type">r</span>
    </li>
</ul>
</figure>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH a
OPTIONAL MATCH (a)-[r]-&gt;(b)
RETURN a, b;</textarea>
</div>
</div>
</section>
<section class="slide" id="_optional_relationships_2">
<h2>Optional relationships</h2>
<div class="paragraph"><p>List organizations and their countries</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (o:Org)
OPTIONAL MATCH o--&gt;(:Office)--&gt;(:City)--&gt;(c:Country)
RETURN DISTINCT o.name, c.name;</textarea>
</div>
</div>
</section>
<section class="slide" id="_relationship_attributes">
<h2>Relationship attributes</h2>
<div class="paragraph slide"><p>Relationships can have attributes as well</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)&lt;-[m:MEMBER]-(:Project)
WHERE p.name = "Charlene"
RETURN m.role;</textarea>
</div>
</div>
</section>
<section class="slide" id="_paths">
<h2>Paths</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH p=(a:Person)&lt;-[:EMPLOYEE]-(d)-[:EMPLOYEE]-&gt;(b:Person)
WHERE a.name = "Daniel"
RETURN p;</textarea>
</div>
</div>
</section>
<section class="slide" id="_variable_length_paths">
<h2>Variable length paths</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH p = (a)-[:REL*0..]-&gt;(b)
RETURN p;</textarea>
</div>
</div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH p = (a)-[:REL*1..3]-&gt;(b)
RETURN p;</textarea>
</div>
</div>
</section>
<section class="slide" id="_result_with_alias">
<h2>Result with alias</h2>
<div class="paragraph slide"><p><code>AS</code> sets name for result column</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p)&lt;-[:EMPLOYEE]-(d)
RETURN p.name as employee,
  d.name as `department`;</textarea>
</div>
</div>
</section>
<section class="slide canvas-image" id="_aggregation" style="background-image: url(./img/aggregation-sw.jpg)">
<div class="paragraph canvas-caption"><p class="center">Aggregation</p></div>
<div class="paragraph img-ref"><p>derivative of <a href="https://www.flickr.com/photos/zscheyge/49012397">"Building Blocks"</a> by <a href="https://www.flickr.com/photos/zscheyge/">Holger Zscheyge</a> / <a href="http://creativecommons.org/licenses/by/2.0/">CC BY</a></p></div>
</section>
<section class="slide" id="_aggregation_2">
<h2>Aggregation</h2>
<div class="paragraph slide"><p><code>count(*)</code> counts matching rows</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p)&lt;-[:EMPLOYEE]-(d)
RETURN d.name, count(*);</textarea>
</div>
</div>
<div class="paragraph slide"><p><code>count(x)</code> counts non-NULL values in x</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (d:Dept)
OPTIONAL MATCH (p)&lt;-[:EMPLOYEE]-(d)
RETURN d.name, count(p);</textarea>
</div>
</div>
</section>
<section class="slide" id="_aggregation_3">
<h2>Aggregation</h2>
<div class="paragraph slide"><p>returns only departments with at least one member</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p)&lt;-[:EMPLOYEE]-(d)
RETURN d.name, count(*);</textarea>
</div>
</div>
<div class="paragraph slide"><p>returns all departments</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (d:Dept)
OPTIONAL MATCH (p)&lt;-[:EMPLOYEE]-(d)
RETURN d.name, count(p);</textarea>
</div>
</div>
</section>
<section class="slide" id="_collecting">
<h2>Collecting</h2>
<div class="ulist">
<ul>
<li class="slide"><code>collect(x)</code> inserts all values into a list</li>
<li class="slide">can be combined with <code>DISTINCT</code></li>
</ul>
</div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (o:Org)--&gt;(:Office)--&gt;(:City)--&gt;(c:Country)
RETURN o.name AS organization,
  collect(DISTINCT c.name) as countries;</textarea>
</div>
</div>
</section>
<section class="slide" id="_statistics">
<h2>Statistics</h2>
<div class="ulist">
<ul>
<li class="slide"><code>min(x)</code> returns the lowest value</li>
<li class="slide"><code>max(x)</code> returns the highest value</li>
<li class="slide"><code>avg(x)</code> returns the average of a numeric value</li>
<li class="slide"><code>sum(x)</code> returns the sum of all values</li>
<li class="slide">and some more</li>
</ul>
</div>
</section>
<section class="slide" id="_sorting">
<h2>Sorting</h2>
<div class="paragraph slide"><p><code>ORDER BY expr [ASC|DESC]</code> sorts the results (by multiple properties)</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (city:City)-[:IS_IN]-&gt;(country:Country)
RETURN country.name, city.name
ORDER BY country.name, city.name;</textarea>
</div>
</div>
</section>
<section class="slide" id="_limit_and_skip">
<h2>Limit and skip</h2>
<div class="ulist">
<ul>
<li class="slide"><code>LIMIT x</code> returns only the first x entries</li>
<li class="slide"><code>SKIP y</code> omits the first y entries</li>
</ul>
</div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)
RETURN p.name
ORDER BY p.name
SKIP 3
LIMIT 5;</textarea>
</div>
</div>
</section>
<section class="slide canvas-image" id="_it_s_your_turn" style="background-image: url(./img/coding-sw.jpg)">
<div class="paragraph canvas-caption"><p class="center">It&#8217;s your turn!</p></div>
<div class="paragraph img-ref"><p>derivative of <a href="https://www.flickr.com/photos/adikos/4440682278">"Female Typing"</a>
 by <a href="https://www.flickr.com/photos/adikos/">Adikos</a> /
<a href="http://creativecommons.org/licenses/by/2.0/">CC BY</a></p></div>
</section>
<section class="slide" id="_advanced_queries">
<h2>Advanced queries</h2>
<div class="ulist">
<ul>
<li>Who is working in "Project X" at "GraphIT"?</li>
<li>Who is the lead of the "QA" department at "GraphIT"?</li>
<li>How many hours per week is Daniel working?</li>
<li>Find the three persons with the lowest hours per week.</li>
<li>Who is having the same role in projects?</li>
<li>Is Alice a superior of Daniel?</li>
</ul>
</div>
</section>
<section class="slide" id="_project_members">
<h2>Project Members</h2>
<div class="listingblock slide">
<div class="title">Who is working in "Project X" at "GraphIT"?</div>
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)&lt;-[:MEMBER]-(pr:Project),
      (pr)-[:BELONGS_TO]-&gt;(:Dept)-[:PARENT*0..]-&gt;(o:Org)
WHERE pr.name = "Project X" AND o.name = "GraphIT"
RETURN p.name;</textarea>
</div>
</div>
</section>
<section class="slide" id="_department_lead">
<h2>Department Lead</h2>
<div class="listingblock slide">
<div class="title">Who is the lead of the "QA" department at "GraphIT"?</div>
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)&lt;-[:LEAD]-(d:Dept),
      (d)-[:PARENT*0..]-&gt;(o:Org)
WHERE d.name = "QA" AND o.name = "GraphIT"
RETURN p.name;</textarea>
</div>
</div>
</section>
<section class="slide" id="_weekly_worktime">
<h2>Weekly Worktime</h2>
<div class="listingblock slide">
<div class="title">How many hours per week is Daniel working?</div>
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)&lt;-[e:EMPLOYEE]-(d:Dept)
WHERE p.name = "Daniel"
RETURN sum(e.hoursPerWeek) as `hours per week`;</textarea>
</div>
</div>
</section>
<section class="slide" id="_least_working_people">
<h2>Least working people</h2>
<div class="listingblock slide">
<div class="title">Find the three persons with the lowest hours per week.</div>
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)&lt;-[e:EMPLOYEE]-(d:Dept)
RETURN p.name AS name, sum(e.hoursPerWeek) as `hours per week`
ORDER BY `hours per week`
LIMIT 3;</textarea>
</div>
</div>
</section>
<section class="slide" id="_same_project_roles">
<h2>Same Project Roles</h2>
<div class="listingblock slide">
<div class="title">Who is having the same role in projects?</div>
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)&lt;-[m1:MEMBER]-(pr1:Project),
      (p)&lt;-[m2:MEMBER]-(pr2:Project)
WHERE m1.role = m2.role
RETURN p.name AS name, pr1.name, pr2.name, m1.role as role;</textarea>
</div>
</div>
</section>
<section class="slide" id="_superiors">
<h2>Superiors</h2>
<div class="listingblock slide">
<div class="title">Is Alice a superior of Daniel?</div>
<div class="content">
<textarea class="code" mode="cypher">MATCH (a:Person)&lt;-[:LEAD]-(d1:Dept),
      (d1)&lt;-[:PARENT*0..]-(:Dept)-[:EMPLOYEE]-&gt;(d:Person)
WHERE a.name = "Alice"
  AND d.name = "Daniel"
RETURN a, d;</textarea>
</div>
</div>
</section>
<section class="slide canvas-image" id="_datatypes" style="background-image: url(./img/binary-sw.jpg)">
<div class="paragraph canvas-caption"><p class="center">Datatypes</p></div>
<div class="img-ref">
derivative of <a href="https://www.flickr.com/photos/x1brett/6665955101">"Binary"</a> by <a href="https://www.flickr.com/photos/x1brett/">brett jordan</a> / <a href="http://creativecommons.org/licenses/by/2.0/">CC BY</a>
<div>
</section>
<section class="slide" id="_datatypes_2">
<h2>Datatypes</h2>
<div class="ulist">
<ul>
<li class="slide">decimal: floating point or integer (hexadecimal and octal as well)</li>
<li class="slide">string</li>
<li class="slide">boolean</li>
<li class="slide">lists: [3, 4, 5]</li>
<li class="slide">maps: {name: "Alice", email: "<a href="mailto:alice@miller.com">alice@miller.com</a>"}</li>
</ul>
</div>
</section>
<section class="slide" id="_operators">
<h2>Operators</h2>
<div class="ulist">
<ul>
<li class="slide">mathematical: <code>+</code>, <code>-</code>, <code>*</code>, <code>/</code>, <code>%</code>, <code>^</code></li>
<li class="slide">comparison: <code>=</code>, <code>&lt;&gt;</code>, <code>&lt;</code>, <code>&gt;</code>, <code>&#8656;</code>, <code>&gt;=</code>, <code>IS NULL</code>, <code>IS NOT NULL</code></li>
<li class="slide">boolean: <code>AND</code>, <code>OR</code>, <code>XOR</code>, <code>NOT</code></li>
<li class="slide">string concatenation: <code>+</code></li>
<li class="slide">collections: <code>+</code>, <code>IN</code></li>
</ul>
</div>
</section>
<section class="slide canvas-image" id="_functions" style="background-image: url(./img/functions.jpg)">
<div class="paragraph canvas-caption"><p class="center">Functions</p></div>
<div class="paragraph img-ref"><p><a href="https://www.flickr.com/photos/vestman/4908148942">Function</a> by <a href="https://www.flickr.com/photos/vestman/">Vestman</a> / <a href="http://creativecommons.org/licenses/by/2.0/">CC BY</a></p></div>
</section>
<section class="slide" id="_scalar_functions">
<h2>Scalar functions</h2>
<div class="ulist">
<ul>
<li class="slide"><code>length(x)</code>: the length of a path or collection</li>
<li class="slide"><code>type(r)</code>: the type of an relationship</li>
<li class="slide"><code>id(x)</code>: the ID of a node or relationship</li>
<li class="slide"><code>timestamp()</code>: the milliseconds since January 1, 1970 UTC (will be same during the whole query)</li>
<li class="slide"><code>coalesce(x1, x2, &#8230;&#8203;)</code>: the first non-null argument</li>
<li class="slide"><code>head(c)</code> / <code>last(c)</code>: the first / last element of the collection</li>
<li class="slide"><code>startnode(r)</code> / <code>endnode(r)</code>: start / end node of a relationship</li>
</ul>
</div>
</section>
<section class="slide" id="_mathematical_and_string_functions">
<h2>Mathematical and string functions</h2>
<div class="ulist">
<ul>
<li class="slide">mathematical functions like <code>abs</code>, <code>sin</code>, <code>floor</code>, <code>sqrt</code>, &#8230;&#8203;</li>
<li class="slide">string functions like <code>trim</code>, substring, <code>replace</code>, <code>split</code>, <code>length</code> &#8230;&#8203;</li>
<li class="slide"><code>toInt</code> / <code>toFloat</code> / <code>toString</code>: converting to int / float / string</li>
</ul>
</div>
</section>
<section class="slide" id="_predicates">
<h2>Predicates</h2>
<div class="ulist">
<ul>
<li class="slide"><code>ALL(x IN coll WHERE pred)</code>: tests if pred is true for all values in coll</li>
<li class="slide"><code>ANY(x IN coll WHERE pred)</code>: tests if pred is true for at least one value in coll</li>
<li class="slide"><code>NONE(x IN coll WHERE pred)</code>: tests if pred is true for no value in coll</li>
<li class="slide"><code>SINGLE(x IN coll WHERE pred)</code>: tests if pred is true for exactly one value in coll</li>
</ul>
</div>
</section>
<section class="slide" id="_predicates_cont">
<h2>Predicates (cont.)</h2>
<div class="ulist">
<ul>
<li class="slide"><code>EXISTS(x.prop)</code>: tests if x has the property prop</li>
<li class="slide"><code>EXISTS(pattern)</code>: tests if the given pattern exists</li>
</ul>
</div>
</section>
<section class="slide" id="_collection_functions">
<h2>Collection functions</h2>
<div class="ulist">
<ul>
<li class="slide"><code>nodes(p)</code> / <code>relationships(p)</code>: nodes / relationships of a path</li>
<li class="slide"><code>labels(n)</code>: labels of a node</li>
<li class="slide"><code>range(start, end [,step])</code>: integer values in the given range with optional step</li>
</ul>
</div>
</section>
<section class="slide" id="_collection_functions_2">
<h2>Collection functions</h2>
<div class="ulist">
<ul>
<li class="slide"><code>tail(c)</code>: all but the first element of a collection</li>
<li class="slide"><code>extract(x IN coll | expr)</code>: maps all values in coll using expr</li>
<li class="slide"><code>filter(x IN coll WHERE pred)</code>: returns a collection with all elements for that pred is true</li>
<li class="slide"><code>[x in coll WHERE pred | expr]</code> combines filter and extract in one construct</li>
<li class="slide"><code>reduce(acc = inital, x IN coll | expr)</code>: reduces values in coll using acc and expr</li>
</ul>
</div>
</section>
<section class="slide" id="_advanced_filtering">
<h2>Advanced filtering</h2>
<div class="ulist">
<ul>
<li class="slide"><code>=~ "regexp"</code> allows to filter using regular expressions, use flags for lowercase <code>?i</code></li>
<li class="slide">graph-patterns can be used as well</li>
</ul>
</div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (d:Dept), (p:Person)
WHERE p.name =~ "A.*" AND (p)&lt;-[:LEAD]-(d)
RETURN p.name, d.name;</textarea>
</div>
</div>
</section>
<section class="slide" id="_matching_multiple_relationships">
<h2>Matching multiple relationships</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)&lt;-[:EMPLOYEE|:LEAD]-(d:Dept)
return p, d;</textarea>
</div>
</div>
</section>
<section class="slide canvas-image" id="_it_s_your_turn_2" style="background-image: url(./img/coding-sw.jpg)">
<div class="paragraph canvas-caption"><p class="center">It&#8217;s your turn!</p></div>
<div class="img-ref">
derivative of <a href="https://www.flickr.com/photos/adikos/4440682278">"Female Typing"</a> by <a href="https://www.flickr.com/photos/adikos/">Adikos</a> / <a href="http://creativecommons.org/licenses/by/2.0/">CC BY</a>
<div>
</section>
<section class="slide" id="_more_queries">
<h2>More queries</h2>
<div class="olist arabic">
<ol class="arabic">
<li>
List all departments of "GraphIT" and their employees.
</li>
<li>
Who is working for at least two departments?
</li>
<li>
Find all persons with a name starting with an E.
</li>
<li>
Through whom/how many persons do Alice and Charlene know each other?
</li>
<li>
Explore the database. What labels do exist? How many nodes/relationships are stored?
</li>
</ol>
</div>
</section>
<section class="slide" id="_1_departments_of_graphit">
<h2>1. Departments of "GraphIT"</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (d:Dept)-[:PARENT*0..]-&gt;(o:Org {name:"GraphIT"})
OPTIONAL MATCH (p:Person)&lt;-[:EMPLOYEE]-&gt;(d)
RETURN d.name, collect(p.name) as employees;</textarea>
</div>
</div>
</section>
<section class="slide" id="_2_who_is_working_for_at_least_two_departments">
<h2>2. Who is working for at least two departments?</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)&lt;-[:EMPLOYEE]-&gt;(d1:Dept),
      (p)&lt;-[:EMPLOYEE]-&gt;(d2:Dept)
RETURN DISTINCT p.name;</textarea>
</div>
</div>
</section>
<section class="slide" id="_3_entities_with_name_starting_with_an_e">
<h2>3. Entities with name starting with an E</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)
WHERE p.name =~ "E.*"
RETURN p.name;</textarea>
</div>
</div>
</section>
<section class="slide" id="_4_connection_from_alice_to_charlene">
<h2>4. Connection from Alice to Charlene</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH path=(a:Person)-[:EMPLOYEE|LEAD*0..]-(c:Person)
WHERE a.name = "Alice"
  AND c.name = "Charlene"
RETURN
  length(filter(n IN nodes(path) WHERE n:Person));</textarea>
</div>
</div>
</section>
<section class="slide" id="_5_1_connection_from_alice_to_charlene">
<h2>5.1 Connection from Alice to Charlene</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH path=(a:Person)-[:EMPLOYEE|:LEAD*]-(c:Person)
WHERE a.name = "Alice"
  AND c.name = "Charlene"
RETURN extract(n IN nodes(path) | n.name);</textarea>
</div>
</div>
</section>
<section class="slide" id="_5_2_connection_from_alice_to_charlene">
<h2>5.2 Connection from Alice to Charlene</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH path=(a:Person)-[:EMPLOYEE|:LEAD*]-(c:Person)
WHERE a.name = "Alice"
  AND c.name = "Charlene"
WITH
  filter(n IN nodes(path) WHERE n:Person)
  AS persons
RETURN extract(n IN persons | n.name);</textarea>
</div>
</div>
<div class="paragraph slide"><p><code>WITH</code> allows you to transfer, project, limit and sort results between query parts</p></div>
<div class="listingblock">
<div class="content">
<textarea class="code" mode="cypher">MATCH path=(a:Person)-[:EMPLOYEE|:LEAD*]-(c:Person)
WHERE a.name = "Alice"
  AND c.name = "Charlene"
WITH [n IN nodes(path) WHERE n:Person | n.name];</textarea>
</div>
</div>
</section>
<section class="slide" id="_explore_the_database">
<h2>Explore the database</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (a)-[r]-&gt;(b)
WHERE labels(a) &lt;&gt; [] AND labels(b) &lt;&gt; []
RETURN DISTINCT
  head(labels(a)) AS This,
  type(r) AS To,
  head(labels(b)) AS That;</textarea>
</div>
</div>
</section>
<section class="slide canvas-image" id="_lunch" style="background-image: url(./img/lunch-sw.png)">
<div class="paragraph canvas-caption"><p class="center">Lunch?</p></div>
<div class="img-ref">
derivative of <a href="https://www.flickr.com/photos/dinnerseries/9680684142">"Chilewich Placemats"</a> by <a href="https://www.flickr.com/photos/dinnerseries/">Didriks</a> / <a href="http://creativecommons.org/licenses/by/2.0/">CC BY</a>
<div>
</section>
<section class="slide canvas-image" id="_acid" style="background-image: url(./img/acid-sw.jpg)">
<div class="paragraph canvas-caption"><p class="center">ACID?</p></div>
<div class="paragraph img-ref"><p>derivative of <a href="https://www.flickr.com/photos/somegeekintn/3458948437">"Medicine Cabinet"</a> by
<a href="https://www.flickr.com/photos/somegeekintn/">Casey Fleser</a> /
<a href="http://creativecommons.org/licenses/by/2.0/">CC BY</a></p></div>
</section>
<section class="slide" id="_transactions">
<h2>Transactions</h2>
<div class="ulist">
<ul>
<li class="slide">Every modifying cypher statement runs in a transaction.</li>
<li class="slide">In the Neo4j-Shell you can use <code>begin</code>, <code>commit</code> and <code>rollback</code> to control transactional scope.</li>
<li class="slide">The Cypher-HTTP endpoint also allows transaction control.</li>
</ul>
</div>
</section>
<section class="slide" id="_creating_nodes">
<h2>Creating nodes</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">CREATE (p:Person {name: "Gina"});</textarea>
</div>
</div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)
WHERE p.name="Gina"
RETURN p;</textarea>
</div>
</div>
</section>
<section class="slide" id="_editing_properties">
<h2>Editing properties</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)
WHERE p.name="Gina"
SET p.emal = "gina@smith.com"
RETURN p;</textarea>
</div>
</div>
<section class="slide" id="_ups_misspelt_code_email_code">
<h3>Ups, misspelt <code>email</code></h3>

</section>
</section>
<section class="slide" id="_removing_properties">
<h2>Removing properties</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)
WHERE p.name="Gina"
SET p.email = p.emal
REMOVE p.emal
RETURN p;</textarea>
</div>
</div>
</section>
<section class="slide" id="_creating_relationships">
<h2>Creating relationships</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person), (pr:Project)-[:BELONGS_TO]-&gt;(d:Dept)
WHERE p.name="Gina" AND pr.name = "Project X"
CREATE (pr)-[m:MEMBER {role: "developer"}]-&gt;(p)
CREATE (d)-[e:EMPLOYEE {hoursPerWeek: 40}]-&gt;(p)
RETURN p, m, pr, d, e;</textarea>
</div>
</div>
</section>
<section class="slide" id="_deleting_nodes">
<h2>Deleting nodes</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (gina:Person)
WHERE gina.name="Gina"
DELETE gina;</textarea>
</div>
</div>
<div class="paragraph slide"><p>This will not work because the node has relationships!</p></div>
</section>
<section class="slide" id="_deleting_relationships">
<h2>Deleting relationships</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (gina:Person)-[r]-()
WHERE gina.name="Gina"
DELETE r, gina;</textarea>
</div>
</div>
</section>
<section class="slide" id="_clearing_the_database">
<h2>Clearing the database</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (n)
OPTIONAL MATCH (n)-[r]-&gt;()
DELETE n, r;</textarea>
</div>
</div>
</section>
<section class="slide" id="_match_or_create">
<h2>Match or Create</h2>
<div class="paragraph slide"><p><code>MERGE</code> finds existing nodes, relationships or patterns otherwise creates them</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MERGE (p:Person {name:"Harald"})
RETURN h;</textarea>
</div>
</div>
<div class="paragraph slide"><p>Uses indexes, constraints and locks to guarantee unique lookup and creation.</p></div>
</section>
<section class="slide" id="_match_or_create_2">
<h2>Match or Create</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MERGE (p:Person {name:"Ina"})
ON CREATE SET p.created = timestamp()
ON MATCH  SET p.accessed = coalesce(accessed,0)+1
RETURN p;</textarea>
</div>
</div>
</section>
<section class="slide" id="_create_label_specific_index">
<h2>Create label-specific index</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">CREATE INDEX ON :Person(name);</textarea>
</div>
</div>
<section class="slide" id="_and_constraints">
<h3>And constraints</h3>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">CREATE CONSTRAINT ON (p:Person) ASSERT p.name IS UNIQUE;</textarea>
</div>
</div>
</section>
</section>
<section class="slide" id="_shortest_path">
<h2>Shortest path</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p1:Person {name: "Alice"}),
      (p2:Person {name: "Charlene"}),
      path=shortestPath((p1)-[:EMPLOYEE|:LEAD*..20]-(p2))
RETURN length(path);</textarea>
</div>
</div>
</section>
<section class="slide" id="_more_cypher_features">
<h2>More cypher features</h2>
<div class="ulist">
<ul>
<li class="slide"><code>WITH</code></li>
<li class="slide"><code>UNION</code></li>
<li class="slide"><code>UNWIND</code></li>
<li class="slide"><code>FOREACH</code></li>
<li class="slide"><code>LOAD CSV</code></li>
<li class="slide"><code>START</code></li>
</ul>
</div>
<section class="slide" id="_check_out_the_cypher_refcard">
<h3>Check out the Cypher Refcard</h3>
<div class="paragraph"><p><a class="bare" href="http://docs.neo4j.org/refcard/2.1.4/">http://docs.neo4j.org/refcard/2.1.4/</a></p></div>
</section>
</section>
<section class="slide canvas-image" id="_it_s_your_turn_3" style="background-image: url(./img/coding-sw.jpg)">
<div class="paragraph canvas-caption"><p class="center">It&#8217;s your turn!</p></div>
<div class="img-ref">
derivative of <a href="https://www.flickr.com/photos/adikos/4440682278">"Female Typing"</a> by <a href="https://www.flickr.com/photos/adikos/">Adikos</a> / <a href="http://creativecommons.org/licenses/by/2.0/">CC BY</a>
<div>
</section>
<section class="slide" id="_modify_the_database">
<h2>Modify the database</h2>
<div class="ulist">
<ul>
<li>Create a new organization "MyCom" with "Department 1" to "Department 4" and offices in Amsterdam and Madrid.</li>
<li>Let John work for "Department 3" with 30 hours per week and let Karen be the lead of this department.</li>
<li>Remove all humans that are not employee or lead of any department.</li>
<li>Create a CSV file with some names and e-mail addresses and import these people with <code>LOAD CSV</code> into your database and let them become employees of "Department 4".</li>
</ul>
</div>
</section>
<section class="slide" id="_create_an_organization">
<h2>Create an organization</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">CREATE (o:Org:Dept:Entity {name: "MyCom"})
FOREACH (num IN range(1,4) |
  CREATE (o)&lt;-[:PARENT]-(d:Dept {name: "Department " + num}))
MERGE (n:Country {name: "Netherlands"})
MERGE (s:Country {name: "Spain"})
MERGE (a:City {name: "Amsterdam"})-[:IS_IN]-&gt;(n)
MERGE (m:City {name: "Madrid"})-[:IS_IN]-&gt;(s)
CREATE (o)-[:SITE]-&gt;(:Office)-[:LOCATION]-&gt;(a)
CREATE (o)-[:SITE]-&gt;(:Office)-[:LOCATION]-&gt;(m)
RETURN o;</textarea>
</div>
</div>
</section>
<section class="slide" id="_add_people_to_department_3">
<h2>Add people to "Department 3"</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (o:Org)-[:PARENT]-(d:Dept)
WHERE o.name = "MyCom"
  AND d.name = "Department 3"
CREATE (j:Person {name: "John"}),
  (j)&lt;-[:EMPLOYEE {hoursPerWeek: 30}]-(d)
CREATE (k:Person {name: "Karen"}),
  (k)&lt;-[:LEAD]-(d)
RETURN j, k;</textarea>
</div>
</div>
</section>
<section class="slide" id="_remove_persons_without_organizational_unit">
<h2>Remove persons without organizational unit</h2>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">MATCH (p:Person)
WHERE NOT (p)&lt;-[:EMPLOYEE|:LEAD]-()
DELETE p;</textarea>
</div>
</div>
</section>
<section class="slide" id="_import_csv">
<h2>Import CSV</h2>
<div class="paragraph slide"><p>persons.csv</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="csv">"Lars Higgs","lars@higgs.com"
"Maura Wilson","maura@wilson.com"</textarea>
</div>
</div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">LOAD CSV FROM 'file:///tmp/persons.csv' AS line
CREATE (p:Person {name: line[0], email: line[1]});</textarea>
</div>
</div>
</section>
<section class="slide" id="_import_csv_2">
<h2>Import CSV (2)</h2>
<div class="paragraph slide"><p>persons.csv</p></div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="csv">name,email
"Lars Higgs";"lars@higgs.com"
"Maura Wilson";"maura@wilson.com"</textarea>
</div>
</div>
<div class="listingblock slide">
<div class="content">
<textarea class="code" mode="cypher">LOAD CSV FROM 'file:///tmp/persons.csv' WITH HEADERS AS line
FIELDTERMINATOR ";"
MERGE (p:Person {email: line.email}) ON CREATE SET p.name = line.name;</textarea>
</div>
</div>
</section>
<section class="slide canvas-image" id="_coffee_2" style="background-image: url(./img/coffee2-sw.jpg)">
<div class="paragraph canvas-caption"><p class="center">Coffee?</p></div>
<div class="img-ref">
derivative of <a href="https://www.flickr.com/photos/bortescristian/8442828274">"Coffee cupping at Olivo Caffe with barista Marius Nica"</a> by <a href="https://www.flickr.com/photos/bortescristian/">Cristian Bortes</a> / <a href="http://creativecommons.org/licenses/by/2.0/">CC BY</a>
<div>
</section>
<section class="slide" id="_comparison_rdb_vs_graphdb">
<h2>Comparison RDB vs. GraphDB</h2>
<div class="paragraph"><p>What about</p></div>
<div class="ulist">
<ul>
<li>Integrity, consistency and constraints</li>
<li>Hierarchies and Trees</li>
<li>Bi-directional relations</li>
<li>Many-to-many relations</li>
<li>Schema and/or data migrations</li>
</ul>
</div>
</section>
<section class="slide" id="_technical_aspects">
<h2>Technical aspects</h2>
<div class="ulist">
<ul>
<li>Index-free adjencency</li>
<li>(De-)normilization</li>
<li>Null values and Not-Null-Constraints</li>
</ul>
</div>
</section>
<section class="slide canvas-image" id="_it_s_your_turn_4" style="background-image: url(./img/coding-sw.jpg)">
<div class="paragraph canvas-caption"><p class="center">Develop with Neo4j &amp; Cypher</p></div>
<div class="img-ref">
derivative of <a href="https://www.flickr.com/photos/adikos/4440682278">"Female Typing"</a> by <a href="https://www.flickr.com/photos/adikos/">Adikos</a> / <a href="http://creativecommons.org/licenses/by/2.0/">CC BY</a>
<div>
</section>
<section class="slide" id="_4_available_apis">
<h2>4 available APIs</h2>
<div class="ulist">
<ul>
<li class="slide"><p>
Remote<div class="ulist">
<ul>
<li>Cypher HTTP Endpoint (with drivers)</li>
</ul>
</div></p></li>
<li class="slide"><p>
Embedded / Server-Extension<div class="ulist">
<ul>
<li>Cypher</li>
<li>Java API</li>
<li>Batch-Inserter API</li>
</ul>
</div></p></li>
</ul>
</div>
</section>
<section class="slide" id="_cypher_http_endpoint">
<h2>Cypher HTTP Endpoint</h2>
<div class="ulist">
<ul>
<li>POST multiple statements with parameters</li>
<li>to <code>/db/data/transaction/[:id]/[commit]</code></li>
<li>Transaction support across requests</li>
<li>Multiple result formats</li>
</ul>
</div>
<div class="listingblock">
<div class="content">
<textarea class="code" mode="json">curl -i -H accept:application/json -H content-type:application/json \
-XPOST http://localhost:7474/db/data/transaction/commit \
  -d '{"statements":[{"statement":"CREATE (p:Person {name:{name}}) RETURN p",
       "parameters":{"name":"Daniel"}}]}'

{"results":[{"columns":["p"],"data":[{"row":[{"name":"Daniel"}]}]}],"errors":[]}</textarea>
</div>
</div>
</section>
<section class="slide" id="_drivers">
<h2>Drivers</h2>
<div class="ulist">
<ul>
<li class="slide">Java: Neo4j-JDBC, Spring Data Neo4j, XO</li>
<li class="slide">Python: Py2Neo, neo4j-rest-client</li>
<li class="slide">Ruby: neo4j.rb, Neography</li>
<li class="slide">.Net: neo4jclient, &#8230;&#8203;</li>
<li class="slide">JavaScript: node-neo4j, &#8230;&#8203;</li>
</ul>
</div>
</section>
<section class="slide" id="_drivers_cont">
<h2>Drivers (cont.)</h2>
<div class="ulist">
<ul>
<li class="slide">Scala: AnormCypher</li>
<li class="slide">Clojure: neocons</li>
<li class="slide">Go: cq, neoism</li>
<li class="slide">Haskell:</li>
</ul>
</div>
</section>
<section class="slide" id="_drivers_neo4j_jdbc">
<h2>Drivers: Neo4j-JDBC</h2>
<div class="ulist">
<ul>
<li>prepared statement and parameter support</li>
<li>remote transactions</li>
</ul>
</div>
<div class="listingblock">
<div class="content">
<textarea class="code" mode="java">// Connect
Connection con = DriverManager.getConnection("jdbc:neo4j://localhost:7474/");

String query =
    "MATCH (:Person {name:{1}})-[:EMPLOYEE]-(d:Dept) RETURN d.name as dept";
try (PreparedStatement stmt = con.prepareStatement(QUERY)) {
    stmt.setString(1,"John");
    ResultSet rs = stmt.executeQuery();
    while(rs.next()) {
        System.out.println(rs.getString("dept"));
    }
}</textarea>
</div>
</div>
</section>
<section class="slide" id="_drivers_py2neo">
<h2>Drivers: py2neo</h2>
<div class="listingblock">
<div class="content">
<textarea class="code" mode="python">from py2neo import neo4j

url = os.environ.get('NEO4J_URL',"http://localhost:7474/db/data")
graph = neo4j.GraphDatabaseService(url)

query = "MERGE (:Person {name:{name}})"
neo4j.CypherQuery(graph, query).run(name="Alice")</textarea>
</div>
</div>
</section>
<section class="slide" id="_drivers_neography">
<h2>Drivers: Neography</h2>
<div class="listingblock">
<div class="content">
<textarea class="code" mode="ruby">neo = Neography::Rest.new("http://localhost:7474")

query = "MERGE (:Person {name:{name}})"
neo.execute_query(query,{:name =&gt; "Alice"})</textarea>
</div>
</div>
</section>
<section class="slide" id="_extend_neo4j_server">
<h2>Extend Neo4j Server</h2>
<div class="ulist">
<ul>
<li>20% high performance operations</li>
<li>No network overhead</li>
<li>Use of embedded Java-APIs</li>
<li>Create custom HTTP/REST-endpoints with JAX-RS transporting your domain and protocol</li>
<li>Configure mount-point</li>
<li>Deploy package jar and dependencies in servers <code>plugin</code> directory</li>
</ul>
</div>
</section>
<section class="slide" id="_java_embedded">
<h2>Java Embedded</h2>
<div class="ulist">
<ul>
<li><code>Node</code>, <code>Relationship</code>, <code>Path</code> objects</li>
<li>Object oriented API</li>
<li>Access and update properties and relationships</li>
<li>Manual transaction control</li>
<li>Transaction Event Listener</li>
</ul>
</div>
</section>
<section class="slide" id="_cypher_embedded_example">
<h2>Cypher Embedded Example</h2>
<div class="listingblock">
<div class="content">
<textarea class="code" mode="java">GraphDatabaseService db = new GraphDatabaseFactory().newEmbeddedDatabase(PATH);
ExecutionEngine cypher = new ExecutionEngine(db); // store safely
String query =
    "MATCH (:Person {name:{name}})-[:EMPLOYEE]-(d:Dept) RETURN d.name as dept";
ExecutionResult result = cypher.execute(query, map("name","Fred"));
for (Map&lt;String,Object&gt; row : result) {
   String dept = (String)row.get(dept);
   ...
}</textarea>
</div>
</div>
</section>
<section class="slide" id="_java_embedded_example">
<h2>Java Embedded Example</h2>
<div class="listingblock">
<div class="content">
<textarea class="code" mode="java">GraphDatabaseService db = new GraphDatabaseFactory().newEmbeddedDatabase(PATH);
try (Transaction tx = db.beginTx()) {
   Node john        = db.createNode(Labels.PERSON);
                      john.setProperty("name","John");
   Node dept4       = single(db.findNodesByLabelAndProperty(Labels.DEPT,"name","dept4"));
   Relationship rel = john.createRelationshipTo(dept4,RelTypes.EMPLOYEE);
   tx.success();
}</textarea>
</div>
</div>
</section>
<section class="slide" id="_traversal_framework">
<h2>Traversal Framework</h2>
<div class="ulist">
<ul>
<li>DSL to declare graph traversals programmatically</li>
<li>custom Path- and Relationship-Expanders</li>
<li>custom Evaluators (progress and inclusion)</li>
<li>result uniqueness, breadth- vs depth-first</li>
</ul>
</div>
<div class="listingblock">
<div class="content">
<textarea class="code" mode="java">TraversalDescription trav =
db.traversalDescription().breadthFirst()
  .relationshipTypes(RelTypes.COUNTRY,)
  .relationshipTypes(RelTypes.LOCATION,)
  .evaluator(Evaluators.atDepth(2));

for (Node office : trav.traverse(country)) {
   System.out.println(office.getProperty("name"));
}</textarea>
</div>
</div>
</section>
<section class="slide" id="_batch_inserter">
<h2>Batch Inserter</h2>
<div class="ulist">
<ul>
<li>high performance, non-transactional store-level API</li>
<li>no safety net</li>
</ul>
</div>
<div class="listingblock">
<div class="content">
<textarea class="code" mode="java">BatchInserter inserter = BatchInserers.inserter(path, options);
long emma   = inserter.createNode(map("name","Emma"), Labels.Person);
long claire = inserter.createNode(map("name","Claire"), Labels.Person);
long knows  = inserter.createRelationship(map("since",2010), RelType.KNOWS);
inserter.shutdown();</textarea>
</div>
</div>
</section>
<section class="slide" id="_what_are_we_missing">
<h2>What are we missing ?</h2>
<div class="paragraph"><p>A tool to:</p></div>
<div class="ulist">
<ul>
<li class="slide">quickly sketch out graph models</li>
<li class="slide">document and discuss use-cases</li>
<li class="slide">incrementally build the graph</li>
<li class="slide">life queries with error checking</li>
<li class="slide">shareable and collaborative</li>
<li class="slide">easy to write, read, manage and version</li>
</ul>
</div>
</section>
<section class="slide" id="_what_is_a_gist">
<h2>What is a gist?</h2>
<div class="ulist">
<ul>
<li class="slide">A useful snippet of information</li>
<li class="slide">Easy to share, fork and change</li>
<li class="slide">Nicely rendered and presented</li>
</ul>
</div>
</section>
<section class="slide" id="_what_is_a_graphgist">
<h2>What is a GraphGist?</h2>
<section class="slide" id="_an_asciidoc_file_with">
<h3>an AsciiDoc file with:</h3>
<div class="ulist">
<ul>
<li class="slide">a graph domain model (cypher)</li>
<li class="slide">describing text and pictures</li>
<li class="slide">some example queries checked against the model</li>
<li class="slide">interactively executable (Cypher)</li>
<li class="slide">a Neo4j Console for further exploration</li>
</ul>
</div>
</section>
</section>
<section class="slide canvas-image" id="_really_the_graphgist_idea" style="background-image: url(../../img/graphgist/got_gist.jpg)">
<div class="paragraph canvas-caption"><p class="bottom-right"><a class="bare" href="http://gist.neo4j.org/?6029850">http://gist.neo4j.org/?6029850</a></p></div>
</section>
<section class="slide" id="_what_does_it_look_like">
<h2>What does it look like?</h2>
<div class="listingblock small">
<div class="content">
<textarea class="code">= The Game of Thrones in Neo4j

 image::http://maxdemarzidotcom.files.wordpress.com/2013/06/neoiscoming.jpg?w=580[]

 == The setup

 //hide
 [source,cypher]
 ----
 CREATE
 (_0 { name:"Westeros" }),
 (_1 { house:"Tully" }),
 ...
 (_13 { name:"Danaerys" }),
 ...
 (_28 { name:"Tyrion" }),
 _1-[:HOUSE]-&gt;_0,
 _13-[:MARRIED_TO]-&gt;_12,
 _14-[:CHILD_OF]-&gt;_8,
 ...
 _27-[:CHILD_OF]-&gt;_19, _28-[:CHILD_OF]-&gt;_10
 ----

 //graph

 == Find all children of all houses

 [source, cypher]
 ----
 MATCH (westeros)&lt;-[:HOUSE]-(house)&lt;-[:OF_HOUSE]-(ancestor), family=(ancestor)&lt;-[:CHILD_OF*0..]-(last)
 WHERE westeros.name='Westeros'
 RETURN house.house, collect(DISTINCT last.name)
 ----

 //table

 == Find all the children of parents that are siblings

 [source,cypher]
 ----
 MATCH (kid)-[:CHILD_OF]-&gt;(parent1)-[:CHILD_OF]-&gt;(ancestor)&lt;-[:CHILD_OF]-(parent2)&lt;-[:CHILD_OF]-(kid)
 RETURN DISTINCT kid.name as name
 ----

 //table</textarea>
</div>
</div>
</section>
<section class="slide" id="_what_does_it_look_like_setup">
<h2>What does it look like? (setup)</h2>
<div class="listingblock">
<div class="content">
<textarea class="code">= The Game of Thrones in Neo4j

 image::http://maxdemarzidotcom.files.wordpress.com/2013/06/neoiscoming.jpg?w=580[]

 == The setup

 //hide
 [source,cypher]
 ----
 CREATE
 (_0 { name:"Westeros" }),
 (_1 { house:"Tully" }),
 ...
 (_13 { name:"Danaerys" }),
 ...
 (_28 { name:"Tyrion" }),
 _1-[:HOUSE]-&gt;_0,
 _13-[:MARRIED_TO]-&gt;_12,
 _14-[:CHILD_OF]-&gt;_8,
 ...
 _27-[:CHILD_OF]-&gt;_19, _28-[:CHILD_OF]-&gt;_10
 ----

 //graph</textarea>
</div>
</div>
</section>
<section class="slide" id="_what_does_it_look_like_use_case">
<h2>What does it look like? (use-case)</h2>
<div class="listingblock">
<div class="content">
<textarea class="code">== Find all children of all houses

  [source, cypher]
  ----
  MATCH (westeros)&lt;-[:HOUSE]-(house)&lt;-[:OF_HOUSE]-(ancestor), family=(ancestor)&lt;-[:CHILD_OF*0..]-(last)
  WHERE westeros.name='Westeros'
  RETURN house.house, collect(DISTINCT last.name)
  ----

  //table

  //graph</textarea>
</div>
</div>
</section>
<section class="slide canvas-image" id="_graph_gist_graph" style="background-image: url(../../img/graphgist/graphgist.jpg)">

</section>
<section class="slide canvas-image" id="_power_tool_combo" style="background-image: url(../../img/graphgist/blank.png)">
<h1>Power Tool Combo</h1>
</section>
<section class="slide" id="_power_combination_of_cool_tools">
<h2>Power Combination of Cool Tools</h2>
<div class="ulist">
<ul>
<li class="slide">AsciiDoc(tor) running in Browser with Opal.js</li>
<li class="slide">Cypher</li>
<li class="slide">Neo4j Console</li>
<li class="slide">JavaScript (D3.js, jQuery)</li>
<li class="slide">HTML5 (postMessage)</li>
<li class="slide">GitHub Gists</li>
</ul>
</div>
<section class="slide" id="_the_glue_javascript">
<h3>The Glue? Javascript</h3>

</section>
</section>
<section class="slide canvas-image" id="_swiss_army_knife" style="background-image: url(../../img/graphgist/swiss-army-knife.jpg)">

</section>
<section class="slide" id="_how_does_it_work_rendering">
<h2>How does it work (Rendering)?</h2>
<div class="olist arabic">
<ol class="arabic">
<li class="slide">
Load Gist file from GitHub Gist / Url
</li>
<li class="slide">
Render AsciiDoc to HTML5 on the fly
</li>
<li class="slide">
Write to page / CSS
</li>
<li class="slide">
Placeholder replacement
</li>
</ol>
</div>
</section>
<section class="slide" id="_how_does_it_work_queries">
<h2>How does it work (Queries) ?</h2>
<div class="olist arabic">
<ol class="arabic" start="5">
<li class="slide">
Instantiate Console IFrame
</li>
<li class="slide">
Find all setup- and use-case queries
</li>
<li class="slide">
Send to Console, Check Results
</li>
<li class="slide">
Render Results as Table or Graph
</li>
<li class="slide">
Reset and Show Console
</li>
</ol>
</div>
</section>
<section class="slide" id="_next_steps">
<h2>Next steps</h2>
<section class="slide" id="_the_rise_of_the_graph">
<h3>The rise of the graph</h3>

</section>
<section class="slide" id="_it_s_not_just_social">
<h3>It&#8217;s not just social</h3>

</section>
<section class="slide" id="_find_the_graphs_in_your_domain_and_model_them">
<h3>Find the graphs in your domain,and model them</h3>

</section>
</section>
<section class="slide" id="_get_involved_in_the_community">
<h2>Get involved in the community</h2>

</section>
<section class="slide" id="_graphgists">
<h2>Graphgists</h2>
<div class="paragraph"><p><a class="bare" href="http://gist.neo4j.org">http://gist.neo4j.org</a></p></div>
</section>
<section class="slide" id="_stackoverflow">
<h2>StackOverflow</h2>
<div class="imageblock">
<div class="content">
<img alt="so" src="../../img/so.png">
</div>
</div>
<div class="paragraph"><p><a class="bare" href="http://stackoverflow.com/questions/tagged/neo4j">http://stackoverflow.com/questions/tagged/neo4j</a></p></div>
</section>
<section class="slide" id="_neo4j_google_group">
<h2>Neo4j Google Group</h2>
<div class="imageblock">
<div class="content">
<img alt="google group" src="../../img/google_group.png">
</div>
</div>
<div class="paragraph"><p><a class="bare" href="http://groups.google.com/group/neo4j">http://groups.google.com/group/neo4j</a></p></div>
</section>
<section class="slide" id="_github_issues_and_code">
<h2>Github Issues and code</h2>
<div class="imageblock">
<div class="content">
<img alt="github" src="../../img/github.png">
</div>
</div>
<div class="paragraph"><p><a class="bare" href="https://github.com/neo4j/neo4j/issues">https://github.com/neo4j/neo4j/issues</a></p></div>
</section>
<section class="slide" id="_meetups_user_groups">
<h2>Meetups/User groups</h2>
<div class="imageblock">
<div class="content">
<img alt="meetups" src="../../img/meetups.png">
</div>
</div>
<div class="paragraph"><p><a class="bare" href="http://neo4j.meetup.com/">http://neo4j.meetup.com/</a></p></div>
</section>
<section class="slide" id="_the_graphistas_map">
<h2>The Graphistas map</h2>
<div class="imageblock">
<div class="content">
<img alt="graphistas map" src="../../img/graphistas_map.png">
</div>
</div>
<div class="paragraph"><p><a class="bare" href="http://www.neo4j.org/participate/contributors#map">http://www.neo4j.org/participate/contributors#map</a></p></div>
</section>
<section class="slide" id="__thank_you">
<h2>(Thank You)</h2>
<div class="ulist">
<ul>
<li><a class="bare" href="http://www.neo4j.org">http://www.neo4j.org</a></li>
<li><a class="bare" href="http://groups.google.com/group/neo4j">http://groups.google.com/group/neo4j</a></li>
<li><a class="bare" href="http://www.neo4j.org/develop">http://www.neo4j.org/develop</a></li>
</ul>
</div>
</section>
<section class="slide" id="__graphs_are_everywhere">
<h2>(Graphs are everywhere)</h2>

</section>
<a class="deck-prev-link" href="#" title="Previous">&#8592;</a>
<a class="deck-next-link" href="#" title="Next">&#8594;</a>
<p class="deck-status">
<span class="deck-status-current"></span>
/
<span class="deck-status-total"></span>
</p>
<form action="." class="goto-form" method="get">
<label for="goto-slide">Go to Slide:</label>
<input id="goto-slide" list="goto-datalist" name="slidenum" type="text">
<datalist id="goto-data-list"></datalist>
<input type="submit" value="Go">
</form>
<a class="deck-permalink" href="." title="Permalink to this slide">#</a>
<script src="../../../../asciidoc/deck.js/extensions/hash/deck.hash.js"></script>
<script src="../../../../asciidoc/deck.js/extensions/scale/deck.scale.js"></script>
<script src="../../../../asciidoc/deck.js/extensions/blank/deck.blank.js"></script>
<script src="../../../../asciidoc/deck.js/extensions/goto/deck.goto.js"></script>
<script src="../../../../asciidoc/deck.js/extensions/menu/deck.menu.js"></script>
<script src="../../../../asciidoc/deck.js/extensions/navigation/deck.navigation.js"></script>
<script src="../../../../asciidoc/deck.js/extensions/split/deck.split.js"></script>
<script src="../../../../asciidoc/deck.js/extensions/status/deck.status.js"></script>
<script src="../../../../asciidoc/deck.js/extensions/toc/deck.toc.js"></script>
<div class="deck-toc"></div>
<script src="../../../../asciidoc/deck.js/extensions/arrows/home.js"></script>
<script src="../../../../asciidoc/deck.js/extensions/arrows/d3.v3.js"></script>
<script src="../../../../asciidoc/deck.js/extensions/arrows/arrows-graph-diagram.js"></script>
<script src="../../../../asciidoc/deck.js/extensions/arrows/arrows-init.js"></script>
<footer>Copyright (c) 2014, Neo Technology, Inc. All rights reserved. The reproduction or distribution of this copyrighted work is strictly prohibited.</footer>
<script src="../../../../asciidoc/js/checkcypher.js"></script>
<script>
  (function($, deck, undefined) {
    $.deck.defaults.keys['previous'] = [8, 33, 37, 39];
    $.deck.defaults.keys['next'] = [13, 32, 34, 39];
  
    $.extend(true, $[deck].defaults, {
        countNested: false
    });
  
    $.deck('.slide');
  })(jQuery, 'deck');
</script>
<style>
  .slide.canvas-image {
  -moz-background-size: cover;
  -webkit-background-size: cover;
  -o-background-size: cover;
  background-size: cover;
  display: -moz-box;
  display: -webkit-box;
  display: -ms-box;
  display: box;
  -moz-box-orient: vertical;
  -webkit-box-orient: vertical;
  -ms-box-orient: vertical;
  box-orient: vertical;
  -moz-box-align: start;
  -webkit-box-align: start;
  -ms-box-align: start;
  box-align: start;
  -moz-box-pack: start;
  -webkit-box-pack: start;
  -ms-box-pack: start;
  box-pack: start;}
  
  .bottom-left {
    left: 1%;
    bottom: 20%; }
  
  .top-left {
    left: 1%;
    top: 20%; }
  
  .bottom-right {
    right: 1%;
    bottom: 20%; }
  
  .top-right {
    right: 1%;
    top: 20%; }
  
  .center-up {
    right: 50%;
    top: 1%;
  }
  
  .center-down {
    right: 50%;
    bottom: 1%;
  }
  .canvas-image .canvas-caption p {
    left: 0;
    right: 0;
    top: 50%;
    text-align: center;
    -webkit-transform: translate(0, -50%);
    -moz-transform: translate(0, -50%);
    -ms-transform: translate(0, -50%);
    -o-transform: translate(0, -50%);
    transform: translate(0, -50%);
    display: inline;
    position: absolute;
    background-color: rgba(0, 0, 0, 0.7);
    font-weight: bold;
    font-size: 3em;
    -webkit-box-shadow: 2px 2px 2px #000;
    -moz-box-shadow: 2px 2px 2px #000;
    box-shadow: 2px 2px 2px #000;
    padding: 1em;
    color: white; }
  kbd.keyseq { color: #555555; }
  kbd:not(.keyseq) {
    display: inline-block;
    color: #222222;
    font-size: 0.7em;
    line-height: 1.4;
    background-color: #F7F7F7;
    border: 1px solid #ccc;
    -webkit-border-radius: 3px;
    border-radius: 3px;
    -webkit-box-shadow: 0 1px 0 rgba(0, 0, 0, 0.2), 0 0 0 2px white inset;
    box-shadow: 0 1px 0 rgba(0, 0, 0, 0.2), 0 0 0 2px white inset;
    margin: -0.15em 0.15em 0 0.15em;
    padding: 0.2em 0.6em;
    vertical-align: middle;
    white-space: nowrap;
  }
  kbd kbd:first-child { margin-left: 0; }
  kbd kbd:last-child { margin-right: 0; }
</style>
</body>
</html>